app/controllers/courses_controller.rb

  def do_course
    @course = Course.where(params[:course_id])
    @lesson_id = params[:lesson_id]
    @lesson = Lesson.where(course_id: params[:course_id]).first

    @lecture_id = params[:lecture_id]
    @lecture = Lecture.where(lesson_id: @lesson_id).first
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1  ORDER BY "lessons"."id" ASC LIMIT 1  [["course_id", 1]]
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."course_id" = $1 AND "lectures"."lesson_id" = $2  ORDER BY "lectures"."id" ASC LIMIT 1  [["course_id", 1], ["lesson_id", 1]]

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses"  ORDER BY created_at DESC

    def set_course
      #@course = Course.find(params[:course_id])
      @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", nil]]