app/controllers/courses_controller.rb

  def do_course
    @course = Course.find_by_id(params[:course_id])
    @lectures = Lecture.find_by_course_id(params[:course_id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."course_id" = $1 LIMIT 1  [["course_id", 1]]