app/controllers/lectures_controller.rb

  def do_lecture
    @course = Course.find_by_id(params[:course_id])
    @lesson = Lesson.find_by_id(params[:id])
    @lectures = Lecture.find_by_course_id(params[:course_id])
    @course_id = params[:course_id]
    @lesson_id = params[:id]
    @counter = params[:counter].to_i
    #@lecture_id = params[:lecture_id]

    #@lesson = Lesson.where(course_id: params[:course_id]).first

    @lecture_id = params[:lecture_id]
    @totalLectures = Lecture.where(course_id: @course_id, lesson_id: @lesson_id).count
    # @lecture = Lecture.where(course_id: @course_id, lesson_id: @lesson_id).select(:id)

    if(@lecture_id == nil)
      @lecture_id = nil
    else
      @lecture_id = params[:lecture_id].to_i + 1
    end

    puts @lecture_id

    if(@lecture_id == nil)
      @lecture = Lecture.where(course_id: @course_id, lesson_id: @lesson_id).first
      @counter = 0
    elsif(Lecture.find_by_id_and_course_id_and_lesson_id(@lecture_id, @course_id, @lesson_id).blank?)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."course_id" = $1 LIMIT 1  [["course_id", 1]]
SELECT COUNT(*) FROM "lectures" WHERE "lectures"."course_id" = $1 AND "lectures"."lesson_id" = $2  [["course_id", 1], ["lesson_id", 1]]
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = $1 AND "lectures"."course_id" = $2 AND "lectures"."lesson_id" = $3 LIMIT 1  [["id", 2], ["course_id", 1], ["lesson_id", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1  ORDER BY "lessons"."id" ASC LIMIT 1  [["course_id", 1]]
SELECT "lectures".* FROM "lectures" WHERE (1)

  def view_lectures
    #@course = Course.where(params[:course_id])
    #@lesson_id = params[:lesson_id]
    #@lesson = Lesson.where(course_id: params[:course_id]).first

    #@lecture_id = params[:lecture_id]
    #@lecture = Lecture.where(lesson_id: @lesson_id).first

    #@course_id = params[:id]
    #@course = Course.find(@course_id)
    #@lessons = Lesson.where(course_id: @course_id)
    @course_id = params[:course_id]

    @lesson_id = params[:id]
    @lesson = Lesson.find(@lesson_id)
    @lectures = Lecture.where(lesson_id: @lesson_id, course_id: @course_id)
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "lectures".* FROM "lectures" WHERE "lectures"."lesson_id" = $1 AND "lectures"."course_id" = $2  [["lesson_id", 1], ["course_id", 1]]

  def index
    @lectures = Lecture.all
---
SELECT "lectures".* FROM "lectures"

    def set_lecture
      @lecture = Lecture.find(params[:id])
---
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."id" = $1 LIMIT 1  [["id", 1]]