app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

  def view_lessons
    #@course_id = params[:id]
    @course_id = params[:course_id]
    @course = Course.find(@course_id)
    @lessons = Lesson.where(course_id: @course_id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1 LIMIT 1  [["course_id", 1]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", 1]]