app/controllers/sitemap_controller.rb

  def index
    @courses = Course.order("created_at DESC")
---
SELECT "courses".* FROM "courses"  ORDER BY created_at DESC