app/controllers/users_controller.rb

SELECT "courses".* FROM "courses"
---
  def overview
    #@current_user ||= User.find(session[:user_id])

    @courses=Course.all